Revit 2025 API
TilePatternsBuiltIn Enumeration
Revit's built-in tile patterns. See TilePattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TilePatternsBuiltIn
Public Enumeration TilePatternsBuiltIn
public enum class TilePatternsBuiltIn
type TilePatternsBuiltIn
Members
Member name | Value | Description
Rectangle | 1
Triangle_Bent | 2
Rhomboid | 3
Hexagon | 4
HalfStep | 5
ThirdStep | 6
TriangleCheckerboard_Bent | 7
RectangleCheckerboard | 8
RhomboidCheckerboard | 9
TriangleStep_Bent | 10
Arrows | 11
ZigZag | 12
Octagon | 13
OctagonRotate | 14
Triangle_Flat | 15
TriangleCheckerboard_Flat | 16
See Also
Reference
Autodesk.Revit.DB Namespace